from django.db import models

GENDER_MALE = 0
GENDER_FEMALE = 1


class Student(models.Model):
    """
    学生模型；
    id: 学号
    name: 真实姓名
    depart: 系号
    attendance_year: 入学年份
    gender: 性别
    """
    DEPARTS = [
        (1, "材料科学与工程学院"),
        (2, "电子信息工程学院"),
        (3, "自动化科学与电器工程学院"),
        (4, "能源与动力工程学院"),
        (5, "航空科学与工程学院"),
        (6, "计算机学院"),
        (7, "机械工程及自动化学院"),
        (8, "经济管理学院"),
        (9, "数学科学学院"),
        (10, "生物与医学工程学院"),
        (11, "人文社会科学学院"),
        (12, "外国语学院"),
        (13, "交通科学与工程学院"),
        (14, "可靠性与系统工程学院"),
        (15, "宇航学院"),
        (16, "飞行学院"),
        (17, "仪器科学与光电学院"),
        (18, "北京学院"),
        (19, "物理学院"),
        (20, "法学院"),
        (21, "软件学院"),
        (23, "高等理工学院"),
        (24, "中法工程师学院"),
        (25, "国际学院"),
        (26, "新媒体艺术与设计学院"),
        (27, "化学学院"),
        (28, "马克思主义学院"),
        (29, "人文与社会科学高等研究院"),
        (30, "空间与环境学院"),
        (31, "无人系统研究院"),
        (32, "航空发动机学院"),
        (35, "国际通用工程学院"),
        # (37, "北航学院"),
        (71, "传源书院"),
        (73, "士谔书院"),
        (74, "冯如书院"),
        (75, "士嘉书院"),
        (76, "守谔书院"),
        (77, "致真书院"),
        (79, "知行书院"),
        (38, "医学科学与工程学院"),
        (39, "网络空间安全学院"),
        (41, "集成电路科学与工程学院"),
        (42, "人工智能研究院"),
        (43, "前沿科学技术创新研究院"),
    ]
    GENDERS = [
        (GENDER_MALE, "男"),
        (GENDER_FEMALE, "女"),
    ]

    id = models.CharField(max_length=12, primary_key=True)
    name = models.CharField(max_length=10)
    depart = models.IntegerField(choices=DEPARTS)
    attendance_year = models.IntegerField()
    gender = models.IntegerField(choices=GENDERS)
